src/InformationRegisters/ИсторияВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаправленияВызова</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательSip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРазговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗвонка</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятДругимАбонентомГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбрабатывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоллтрекингНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомерСотрудника</Name>
					<Comment>Добавочный номер для ITOOLABSE</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокПолученияФайлаЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыОбработкиЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОборудованиеТелефонии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ПользователиГлобальный/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Получить текущие напоминания текущего пользователя.Если передать ссылку на клиента
// будет произведено получение задач и по посещениям
Процедура ПроверитьАктивныеОповещенияКлиента() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	// Получить задачи по времени выполнения.
	ОповещенияКлиента = ПользователиСтоматология.ПолучитьАктивныеОповещенияКлиента();
	
	Для Каждого СтрокаТЗ Из ОповещенияКлиента Цикл
		
		ЗавершитьОповещение = Истина;
		
		Если СтрокаТЗ.Ключ = "ПоказатьОповещениеПользователяСчетНеОплачен" Тогда
			
			// добавить оповещение счет не оплачен
			ПредставлениеСчетНаОплату = СтрокаТЗ.Параметр_1;
			ПоказатьОповещениеПользователя(
			"Неоплаченный счет",,
			ПредставлениеСчетНаОплату,
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Важное,
			ПредставлениеСчетНаОплату);
			
		ИначеЕсли СтрокаТЗ.Ключ = "НовоеСообщениеМессенджер" Тогда 
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ИдСообщения"	, СтрокаТЗ.Параметр_1);
			СтруктураПараметров.Вставить("ИдКлиента"	, СтрокаТЗ.Параметр_4);
			Оповестить(СтрокаТЗ.Ключ, СтруктураПараметров);
			
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
			
		ИначеЕсли СтрокаТЗ.Ключ = "НовыйКонтактМессенджер" Тогда 
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ИдСообщения"	, СтрокаТЗ.Параметр_1);
			СтруктураПараметров.Вставить("ИдКлиента"	, СтрокаТЗ.Параметр_4);
			Оповестить(СтрокаТЗ.Ключ, СтруктураПараметров);
			
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ОбновлениеПараметровФильтрацииМессенджер" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("ИдКонтакта"			, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("Оператор"				, СтрокаТЗ.Параметр_2);
			ПараметрыОповещения.Вставить("ОтложенДо"			, СтрокаТЗ.Параметр_3);
			ПараметрыОповещения.Вставить("Окончание"			, СтрокаТЗ.Параметр_4);
			ПараметрыОповещения.Вставить("СообщениеОтКлиента"	, СтрокаТЗ.Параметр_5);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ДобавленаОнлайнЗапись" Тогда
			
			// добавить оповещение добавлена онлайн запись
			Событие = СтрокаТЗ.Параметр_1;	
			ПараметрыОповещения = Новый Структура("Событие, ОбъектОповещения, СтруктурнаяЕдиница, Ключ", Событие, СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
			ОписаниеОповещения = Новый ОписаниеОповещения("ДобавленаОнлайнЗаписьЗавершение", ОбщегоНазначенияКлиент, ПараметрыОповещения);
			ПоказатьОповещениеПользователя(
			"Добавлена онлайн-запись",
			ОписаниеОповещения,
			Строка(Событие),
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Важное,
			Строка(Событие));       
			
		ИначеЕсли СтрокаТЗ.Ключ = "IPТелефония_ВходящийЗвонок" Тогда // И СтрокаТЗ.ОповещатьДо >= ТекущаяДатаСервера() Тогда
			
			ЗавершитьОповещение 		= Ложь;
			ПараметрыПереадресации 		= Новый Структура("IPТелефонияПодключаемоеОборудование, IDЗвонка, СНомерТелефона, НаНомерТелефона, КонтрагентНаНомере", 
			СтрокаТЗ.Параметр_1, СтрокаТЗ.Параметр_2, СтрокаТЗ.Параметр_3, СтрокаТЗ.Параметр_4, СтрокаТЗ.Параметр_5);
			КлючУникальностиОповещения = "IPТелефония_Звонок_" + СтрокаТЗ.Параметр_3;
			
			Если СтрНайти(СтрокаТЗ.Сообщение, "Нажмите для переадресации") > 0 Тогда
				ПараметрыПереадресации 		= Новый Структура("IPТелефонияПодключаемоеОборудование, IDЗвонка, IDПлеча, СНомерТелефона, НаНомерТелефона, ПереадресацияЗвонка", 
				СтрокаТЗ.Параметр_1, СтрокаТЗ.Параметр_2, СтрокаТЗ.Параметр_3, СтрокаТЗ.Параметр_4, СтрокаТЗ.Параметр_5, Истина);
				КлючУникальностиОповещения 	= "IPТелефония_Звонок_" + СтрокаТЗ.Параметр_4;
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ПереадресацияЗвонкаОбработкаОповещения", IPТелефонияКлиент, ПараметрыПереадресации);
			ИначеЕсли СтрНайти(СтрокаТЗ.Сообщение, "Открыть карточку клиента") > 0 Тогда
				СтрокаТЗ.Сообщение = СтрЗаменить(СтрокаТЗ.Сообщение, "Открыть карточку клиента", ""); 
				ОписаниеОповещения = ПолучитьНавигационнуюСсылку(СтрокаТЗ.Параметр_5);
			ИначеЕсли СтрНайти(СтрокаТЗ.Сообщение, "Открыть заявку клиента") > 0 Тогда
				ОписаниеОповещения = ПолучитьНавигационнуюСсылку(СтрокаТЗ.Параметр_5);				
			ИначеЕсли СтрНайти(СтрокаТЗ.Сообщение, "Создать нового клиента") > 0 Тогда
				ПараметрыОповещения = Новый Структура("НомерТелефона", СтрокаТЗ.Параметр_3);
				ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовогоКлиентаОповещение", IPТелефонияКлиент, ПараметрыОповещения);
			ИначеЕсли СтрНайти(СтрокаТЗ.Сообщение, "Создать потенциального клиента") > 0 Тогда
				ПараметрыОповещения = Новый Структура("НомерТелефона", СтрокаТЗ.Параметр_3);
				ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьПотенциальногоКлиентаОповещение", IPТелефонияКлиент, ПараметрыОповещения);
			ИначеЕсли СтрНайти(СтрокаТЗ.Сообщение, "Открыть форму звонка") > 0 Тогда
				
				Если ЗначениеЗаполнено(СтрокаТЗ.Параметр_1) И ЗначениеЗаполнено(СтрокаТЗ.Параметр_2) Тогда
					ПараметрыОповещения = Новый Структура("ПОIPТелефонии, IDЗвонка, IDПлеча, СНомерТелефона, НаНомерТелефона", СтрокаТЗ.Параметр_1, СтрокаТЗ.Параметр_2, СтрокаТЗ.Параметр_3, СтрокаТЗ.Параметр_4, СтрокаТЗ.Параметр_5);
					ОписаниеОповещения  = Новый ОписаниеОповещения("ОткрытьФормуЗвонкаОповещение", IPТелефонияКлиент, ПараметрыОповещения);
				КонецЕсли;
				
			Иначе	  
				ОписаниеОповещения = Неопределено; 
			КонецЕсли;
			
			ПоказатьОповещениеПользователя(СтрокаТЗ.ЗаголовокОкна, ОписаниеОповещения, СтрокаТЗ.Сообщение, БиблиотекаКартинок.Телефон32, , КлючУникальностиОповещения);
			ПользователиСтоматология.ПеревестиОповещениеКлиентаНа10Сек(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
			
		ИначеЕсли СтрокаТЗ.Ключ = "IPТелефония_ОткрытьФормуВзаимодействияСКлиентом" Тогда
			
			Если ЗначениеЗаполнено(СтрокаТЗ.Параметр_1) И ЗначениеЗаполнено(СтрокаТЗ.Параметр_2) Тогда // И ЗначениеЗаполнено(СтрокаТЗ.Параметр_3) Тогда
				ОткрытьФорму("РегистрСведений.ИсторияВызовов.Форма.ФормаЗвонокКлиента", Новый Структура("ПОIPТелефонии, IDЗвонка, IDПлеча, СНомерТелефона, НаНомерТелефона", СтрокаТЗ.Параметр_1, СтрокаТЗ.Параметр_2, СтрокаТЗ.Параметр_3, СтрокаТЗ.Параметр_4, СтрокаТЗ.Параметр_5), , СтрокаТЗ.Параметр_2);
			КонецЕсли;	
			
		ИначеЕсли СтрокаТЗ.Ключ = "IPТелефония_ПокзатьУведомлениеОПропущенном_" + СтрокаТЗ.Параметр_4 Тогда
			
			ЗавершитьОповещение = Ложь;
			
			ПараметрыСпискаНеОбработанных 	= Новый Структура("ТелефонныйАппарат, ВнутреннийНомер, ВнутреннийНомерРодителя, КлючОповещения", СтрокаТЗ.Параметр_1, СтрокаТЗ.Параметр_2, СтрокаТЗ.Параметр_3, СтрокаТЗ.Параметр_5);			
			ОписаниеОповещения 				= Новый ОписаниеОповещения("ОткрытьСписокПропущенныхЗвонков", IPТелефонияКлиент, ПараметрыСпискаНеОбработанных);
			ПоказатьОповещениеПользователя(СтрокаТЗ.ЗаголовокОкна, ОписаниеОповещения, СтрокаТЗ.Сообщение, БиблиотекаКартинок.ТелефонныйЗвонокПропущенныйБольшой, СтатусОповещенияПользователя.Важное, СтрокаТЗ.Параметр_5);
			Оповестить("ОБНОВИТЬ_КОЛИЧЕСТВО_НЕ_ОБРАБОТАННЫХ", СтрокаТЗ.Параметр_5);
			
			// Завершаем оповещение
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, "IPТелефония_ПокзатьУведомлениеОПропущенном_" + СтрокаТЗ.Параметр_4);
			
		ИначеЕсли СтрокаТЗ.Ключ = "IPТелефония_ОткрытьКарточкуКлиента" Тогда
			ПоказатьЗначение( ,СтрокаТЗ.Параметр_1);
		ИначеЕсли СтрокаТЗ.Ключ = "IPТелефония_СоздатьПотенциальногоКлиента" Тогда
			Представление_Телефон = СтрокаТЗ.Параметр_1;
			XML_Телефон			= УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияПоПредставлению(Представление_Телефон, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
			СтруктураЗаполнения = Новый Структура();
			СтруктураЗаполнения.Вставить("ТелефонКлиента"			, Представление_Телефон); 
			Если СтрокаТЗ.Параметр_2 <> Неопределено Тогда
				СтруктураЗаполнения.Вставить("ИсточникИнформации"	, СтрокаТЗ.Параметр_2);
			КонецЕсли;
			
			ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", , , "IPТелефония_СоздатьПотенциальногоКлиента_" + СтрокаТЗ.Параметр_1);
			МассивСтрокТелефона = ФормаЭлементаКонтакт.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
			НоваяСтрока		= ?(МассивСтрокТелефона.Количество() > 0, МассивСтрокТелефона[0], ФормаЭлементаКонтакт.КонтактнаяИнформация.Добавить());
			НоваяСтрока.Тип	= ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
			НоваяСтрока.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
			НоваяСтрока.Представление = СтрокаТЗ.Параметр_1;
			НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(СтрокаТЗ.Параметр_1, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
			ФормаЭлементаКонтакт.Модифицированность = Истина;
			
			Если СтрокаТЗ.Параметр_2 <> Неопределено Тогда
				ФормаЭлементаКонтакт.Объект.ИсточникИнформации = СтрокаТЗ.Параметр_2;
			КонецЕсли;
			
			ФормаЭлементаКонтакт.Открыть();
			
		// Иначе
		//	
		//	Оповестить(СтрокаТЗ.Ключ);
		//	ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
		
		ИначеЕсли СтрокаТЗ.Ключ = "ПоказатьОповещениеУслугиНаСогласование" Тогда
			
			ПоказатьОповещениеПользователя(
			"Новая услуга на согласование",,,
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Важное,
			Строка(СтрокаТЗ.Ключ)); 
			
			Оповестить("ПоказатьОповещениеУслугиНаСогласование");
			
		ИначеЕсли СтрНачинаетсяС(СтрокаТЗ.Ключ, "ОбновитьСогласованияСтраховыхУслуг") Тогда
					
			УИДСтрокиУслуги = ?(ЗначениеЗаполнено(СтрокаТЗ.Параметр_1), Новый УникальныйИдентификатор(СтрокаТЗ.Параметр_1), Неопределено);
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ИдентификаторСтроки", УИДСтрокиУслуги);
			СтруктураПараметров.Вставить("ИзмененныйПрием", СтрокаТЗ.Параметр_2);			
			
			Оповестить("ОбновитьСогласованияСтраховыхУслуг", СтруктураПараметров);
		
		ИначеЕсли СтрокаТЗ.Ключ = "ОбновлениеРабочегоСтола" Тогда
			
			Оповестить(СтрокаТЗ.Ключ);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ОбновленСтатусЗаявки" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Заявка"				, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("Сотрудник"			, СтрокаТЗ.Параметр_2);
			ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, СтрокаТЗ.Параметр_3);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ОповещениеОНовыхЗаявках" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Заявка"				, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("Сотрудник"			, СтрокаТЗ.Параметр_2);
			ПараметрыОповещения.Вставить("СтруктурнаяЕдиница"	, СтрокаТЗ.Параметр_3);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ИзмененЭтапСделки" Или СтрокаТЗ.Ключ = "ДобавленаСделка" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Сделка"	, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("ВидСделки", СтрокаТЗ.Параметр_2);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ЗакрытьФормуЗвонкаПациенту" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("IDЗвонка"				, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("Телефон"				, СтрокаТЗ.Параметр_2);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ОбновитьЗадачуКанбан" Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Задача"			, СтрокаТЗ.Параметр_1);
			ПараметрыОповещения.Вставить("Сделка"			, СтрокаТЗ.Параметр_2);
			ПараметрыОповещения.Вставить("ВидСделки"		, СтрокаТЗ.Параметр_3);
			ПараметрыОповещения.Вставить("УдалениеЗадачи"	, СтрокаТЗ.Параметр_4);
			
			Оповестить(СтрокаТЗ.Ключ, ПараметрыОповещения);
			
		ИначеЕсли СтрокаТЗ.Ключ = "НовоеСообщениеКонтурСтрохование" Тогда
			
			ПараметрыОповещения = Новый Структура("НомерСписка, ОбъектОповещения, СтруктурнаяЕдиница, Ключ, mediId, eventId, eventPointer, eventDateTime", 
												СтрокаТЗ.Параметр_1, 
												СтрокаТЗ.ОбъектОповещения, 
												СтрокаТЗ.СтруктурнаяЕдиница, 
												СтрокаТЗ.Ключ, 
												СтрокаТЗ.Параметр_2, 
												СтрокаТЗ.Параметр_3, 
												СтрокаТЗ.Параметр_4, 
												СтрокаТЗ.Параметр_5);
	
			ОписаниеОповещения = Новый ОписаниеОповещения("НовоеСообщениеКонтурСтрохование", ОбщегоНазначенияКлиент, ПараметрыОповещения);
			Если СтрокаТЗ.Параметр_6 = 1 Тогда
				ЗаголовокОповещения = "Поступил новый список прикрепления.";
			ИначеЕсли СтрокаТЗ.Параметр_6 = 2 Тогда
				ЗаголовокОповещения = "Поступил новый список открепления.";
			ИначеЕсли СтрокаТЗ.Параметр_6 = 3 Тогда
				ЗаголовокОповещения = "Поступил новый список изменения персональных данных.";
			КонецЕсли;
			
			ПоказатьОповещениеПользователя(ЗаголовокОповещения, 	
			ОписаниеОповещения, 
			СтрокаТЗ.Параметр_1,  
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Важное);
			
		ИначеЕсли СтрокаТЗ.Ключ = "ПредварительнаяЗаписьОтменена" Тогда
			
			ПараметрыОповещения = Новый Структура("Ключ, СтруктурнаяЕдиница, ОбъектОповещения, Сотрудник, ДатаСобытия",
												СтрокаТЗ.Ключ,
												СтрокаТЗ.СтруктурнаяЕдиница,
												СтрокаТЗ.ОбъектОповещения,
												СтрокаТЗ.Параметр_1,
												СтрокаТЗ.Параметр_2);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПредварительнаяЗаписьОтмененаЗавершение", ОбщегоНазначенияКлиент, ПараметрыОповещения);
			
			ПоказатьОповещениеПользователя(СтрокаТЗ.ЗаголовокОкна, 	
			ОписаниеОповещения, 
			СтрокаТЗ.Сообщение,  
			БиблиотекаКартинок.Информация32,
			СтатусОповещенияПользователя.Важное);
			
		Иначе
			ЗавершитьОповещение = Ложь;			
		КонецЕсли; 
		
		Если ЗавершитьОповещение Тогда
			ПользователиСтоматология.ЗавершитьОповещениеКлиента(СтрокаТЗ.ОбъектОповещения, СтрокаТЗ.СтруктурнаяЕдиница, СтрокаТЗ.Ключ);
		КонецЕсли;
	
	КонецЦикла; 

	// ПользователиСтоматология.ОчиститьУстаревшиеОповещенияКлиента();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА НАПОМИНАНИЙ ПОЛЬЗОВАТЕЛЮ

// Запустить обработку системы напоминаний пользователю о текущих задачах
Процедура ЗапуститьНапоминанияПользователюОЗадачах() Экспорт
	
   	ПроверитьТекущиеНапоминанияСтоматология();
	ПодключитьОбработчикОжидания("ЗапуститьНапоминанияПользователюОЗадачах", 60, Истина);

КонецПроцедуры

// Процедура - Обработчик ожидания обновить последнюю активность
//
Процедура ОбработчикОжиданияОбновитьПоследнююАктивность() Экспорт
	
	IPТелефония.ОбновитьПоследниююАктивностьПользователя();
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновитьПоследнююАктивность", 120, Истина);
	
КонецПроцедуры
#КонецОбласти
